app/views/gossips/edit.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
      <%= label_tag 'Auteur' %>
      <%= @gossip.user.first_name %>