app/views/gossips/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
<p class="m5 p3 xshadow border border-light"><%= @gossip.content %></p>
<p><em class='text-grey'> l'auteur est <%= @gossip.user.first_name%> </em></p>

DELETE FROM "gossips" WHERE "gossips"."id" = ?  [["id", 26]]
---

( <em><%= link_to "destroy", @gossip.destroy %> )</em></p>