app/controllers/authors_controller.rb

    def create
      # user = User.create(post_params)
      # redirect_to user_path(user.id)
      @user = User.new(post_params)
      if @user.save # essaie de sauvegarder en base @gossip
---
INSERT INTO "users" ("email", "age", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)