app/controllers/gossips_controller.rb

INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Brunoeeeee"], ["content", "efafeaklfjnaeklfnaeklfnaleknflkaenfklaenflkaenf"], ["user_id", 23], ["created_at", "2021-08-05 17:09:50.688877"], ["updated_at", "2021-08-05 17:09:50.688877"]]
---
    def create #fonction mais pas html
      #  user = User.where(first_name: params[:user_name]).first
      #  user != nil ? user = user.id : user = ""
       @gossip = Gossip.new(title: params[:title],
        content: params[:content],
        user_id: session[:user_id].to_i)
      if @gossip.save # essaie de sauvegarder en base @gossip

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = ?, "updated_at" = ? WHERE "gossips"."id" = ?  [["title", "eligendi corporis quia."], ["updated_at", "2021-08-04 11:23:24.058642"], ["id", 1]]
---
    def update #fonction mais pas html
    @gossip = Gossip.find(params[:id])
    if @gossip.update(params.permit(:title, :content, :user_id))