app/controllers/sessions_controller.rb

  def create
  user = User.find_by(email:params[:email]) # cherche s'il existe un utilisateur en base avec l’e-mail
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "eee"], ["LIMIT", 1]]